EDT/УТ/src/Documents/мгРасчетФОТ/мгРасчетФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгРасчетФОТ</name>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоЗаОсновнуюРаботу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоЗаПодъемы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоОтпускныхБольничных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоНадбавки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодработкаНаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МагистральСПБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НочнойВодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДисциплинарныеВзыскания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МатериальныйУщерб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрафыПДД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоУдержано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыданАвансИЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВСчётЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительныйЛист</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоВыдано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КВыдаче</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УказанияДляБухгалтерии</name>
      <type>
        <types>CatalogRef.мгУказанияДляБухгалтерии</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнениеМенее85</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоПоФиксТарифу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/мгРасчетФОТ/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.мгРасчетФОТ.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	мгРасчетФОТ.ПериодРегистрации,
	|	мгРасчетФОТ.Сотрудники.(
	|		Сотрудник,
	|		Должность,
	|		Организация,
	|		НачисленоЗаОсновнуюРаботу,
	|		НачисленоПоФиксТарифу,
	|		НачисленоЗаПодъемы,
	|		НачисленоОтпускныхБольничных,
	|		НачисленоНадбавки,
	|		ПодработкаНаСкладе,
	|		МагистральСПБ,
	|		НочнойВодитель,
	|		Премия,
	|		ИтогоНачислено,
	|		ВыполнениеМенее85,
	|		ДисциплинарныеВзыскания,
	|		МатериальныйУщерб,
	|		ШтрафыПДД,
	|		Пропуска,
	|		ИтогоУдержано,
	|		ВыданАвансИЗП,
	|		ВСчётЗП,
	|		ИсполнительныйЛист,
	|		ИтогоВыдано,
	|		КВыдаче,
	|		УказанияДляБухгалтерии
	|	)
	|ИЗ
	|	Документ.мгРасчетФОТ КАК мгРасчетФОТ
	|ГДЕ
	|	мгРасчетФОТ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	ТабДок.Очистить();

	МесяцСтрока = "";
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		//Шапка.Параметры.Заполнить(Выборка);
		МесяцСтрока = Формат(Выборка.ПериодРегистрации, "ДФ='ММММ гггг'");
		Шапка.Параметры.ПериодРегистрации = МесяцСтрока;
		ТабДок.Вывести(Шапка);

		ТабДок.Вывести(ОбластьСотрудникиШапка);
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
